<h1>Academy Award Nominations Continued...</h1>

In the previous notebook, we walked through cleaning and preparing the original CSV dataset on Academy Award nominations and exported the data into a SQLite database as a single, denormalized table. In this notebook, we will walk through how to normalize our single table into multiple tables and how to create relations between them.

In [2]:
#Import dependencies
import sqlite3 as sql

In [3]:
conn = sql.connect('nominations.db')

In [3]:
schema = conn.execute('pragma table_info(nominations);').fetchall()

In [4]:
first_10_q = "SELECT * FROM nominations LIMIT 10;"
first_10 = conn.execute(first_10_q).fetchall()

In [5]:
for e in schema:
    print(e)
for e in first_10:
    print(e)

(0, 'Year', 'INTEGER', 0, None, 0)
(1, 'Category', 'TEXT', 0, None, 0)
(2, 'Nominee', 'TEXT', 0, None, 0)
(3, 'Won', 'INTEGER', 0, None, 0)
(4, 'Movie', 'TEXT', 0, None, 0)
(5, 'Character', 'TEXT', 0, None, 0)
(2010, 'Actor -- Leading Role', 'Javier Bardem', 0, 'Biutiful', 'Uxbal')
(2010, 'Actor -- Leading Role', 'Jeff Bridges', 0, 'True Grit', 'Rooster Cogburn')
(2010, 'Actor -- Leading Role', 'Jesse Eisenberg', 0, 'The Social Network', 'Mark Zuckerberg')
(2010, 'Actor -- Leading Role', 'Colin Firth', 1, "The King's Speech", 'King George VI')
(2010, 'Actor -- Leading Role', 'James Franco', 0, '127 Hours', 'Aron Ralston')
(2010, 'Actor -- Supporting Role', 'Christian Bale', 1, 'The Fighter', 'Dicky Eklund')
(2010, 'Actor -- Supporting Role', 'John Hawkes', 0, "Winter's Bone", 'Teardrop')
(2010, 'Actor -- Supporting Role', 'Jeremy Renner', 0, 'The Town', 'James Coughlin')
(2010, 'Actor -- Supporting Role', 'Mark Ruffalo', 0, 'The Kids Are All Right', 'Paul')
(2010, 'Actor -- Supporting Role', 'Geoffrey Rush', 0, "The King's Speech", 'Lionel Logue')

Let's now add information on the host for each awards ceremony. Instead of adding a Host column to the nominations table and having lots of redundant data, we'll create a separate table called ceremonies which contains data specific to the ceremony itself. 

Let's create a ceremonies table that contains the Year and Host for each ceremony and then set up a one-to-many relationship between ceremonies and nominations

In [ ]:
create_table_q = "CREATE TABLE ceremonies(id INTEGER PRIMARY KEY, Year INTEGER, Host TEXT);"
conn.execute(create_table_q)

In [7]:
years_hosts = [(2010, "Steve Martin"),
               (2009, "Hugh Jackman"),
               (2008, "Jon Stewart"),
               (2007, "Ellen DeGeneres"),
               (2006, "Jon Stewart"),
               (2005, "Chris Rock"),
               (2004, "Billy Crystal"),
               (2003, "Steve Martin"),
               (2002, "Whoopi Goldberg"),
               (2001, "Steve Martin"),
               (2000, "Billy Crystal")
              ]

In [8]:
insert_q = "INSERT INTO ceremonies (Year, Host) VALUES (?,?);"
conn.executemany(insert_q, years_hosts)
ceremonies_schema = conn.execute("pragma table_info(ceremonies);")
ceremonies_10 = conn.execute("SELECT * FROM ceremonies LIMIT 10;")
for e in ceremonies_schema:
    print(e)
for e in ceremonies_10:
    print(e)

(0, 'id', 'INTEGER', 0, None, 1)
(1, 'Year', 'INTEGER', 0, None, 0)
(2, 'Host', 'TEXT', 0, None, 0)
(1, 2010, 'Steve Martin')
(2, 2009, 'Hugh Jackman')
(3, 2008, 'Jon Stewart')
(4, 2007, 'Ellen DeGeneres')
(5, 2006, 'Jon Stewart')
(6, 2005, 'Chris Rock')
(7, 2004, 'Billy Crystal')
(8, 2003, 'Steve Martin')
(9, 2002, 'Whoopi Goldberg')
(10, 2001, 'Steve Martin')

Since we'll be creating relations using foreign keys, we need to turn on foreign key constraints.

In [9]:
conn.execute("PRAGMA foreign_keys = ON;")

The next step is to remove the Year column from nominations and add a new column, ceremony_id, that contains the foreign key reference to the id column in the ceremonies table. Unfortunately, we can't remove columns from an existing table in SQLite or change its schema.

The only alterations we can make to an existing table are renaming it or adding a new column. This means that we can't just remove the Year column from nominations and add the ceremony_id column. We need to instead:

    create a new table nominations_two with the schema we want,
    populate nominations_two with the records we want,
    delete the original nominations table,
    rename nominations_two to nominations.

In [5]:
cr = '''CREATE TABLE nominations_two(id integer 
primary key, category text, nominee text,movie text,
character text, won integer, ceremony_id integer,
foreign key(ceremony_id) references ceremonies(id));'''

conn.execute(cr)

In [10]:
q = '''SELECT ceremonies.id AS ceremony_id, 
nominations.category AS category,
nominations.nominee AS nominee,
nominations.movie AS movie,
nominations.character AS character,
nominations.won as won FROM nominations
INNER JOIN ceremonies ON
nominations.year == ceremonies.year;'''

joined_nominations = conn.execute(q).fetchall()

In [11]:
insert_q = '''INSERT INTO nominations_two(ceremony_id, 
category, nominee, movie, character, won) 
VALUES (?,?,?,?,?,?);'''

In [12]:
conn.executemany(insert_q, joined_nominations)

In [13]:
verify = conn.execute("SELECT * from nominations_two LIMIT 5;").fetchall()
print(verify)

[(1, 'Actor -- Leading Role', 'Javier Bardem', 'Biutiful', 'Uxbal', 0, 1), (2, 'Actor -- Leading Role', 'Javier Bardem', 'Biutiful', 'Uxbal', 0, 12), (3, 'Actor -- Leading Role', 'Jeff Bridges', 'True Grit', 'Rooster Cogburn', 0, 1), (4, 'Actor -- Leading Role', 'Jeff Bridges', 'True Grit', 'Rooster Cogburn', 0, 12), (5, 'Actor -- Leading Role', 'Jesse Eisenberg', 'The Social Network', 'Mark Zuckerberg', 0, 1)]

And it worked, we now have a table with the Year column removed and a ceremony_id collumn which refers to the table 'ceremonies'. We now just need to delete the original table, and rename our new table to 'nominations'.

In [14]:
drop = "DROP TABLE nominations;"
conn.execute(drop)

In [15]:
rename = "ALTER TABLE nominations_two RENAME TO nominations;"
conn.execute(rename)

Let us now demonstrate joins by creating two new tables called 'movies' and 'actors', and then creating a many-to-many relationship between these tables via a join table called 'movies_actors'.

In [16]:
movies = "CREATE TABLE movies(id integer primary key, movie text);"
actors = "CREATE TABLE actors(id integer primary key, actor text);"
movies_actors = "CREATE TABLE movies_actors(id integer primary key, movie_id integer references movies(id), actor_id integer references actors(id));"
conn.execute(movies)
conn.execute(actors)
conn.execute(movies_actors)

In [17]:
insert_movies = "INSERT INTO movies (movie) SELECT DISTINCT movie from nominations;"
insert_actors = "INSERT INTO actors (actor) SELECT DISTINCT nominee from nominations;"
conn.execute(insert_movies)
conn.execute(insert_actors)

print(conn.execute("SELECT * FROM movies LIMIT 5;").fetchall())
print(conn.execute("SELECT * FROM actors LIMIT 5;").fetchall())

[(1, 'Biutiful'), (2, 'True Grit'), (3, 'The Social Network'), (4, "The King's Speech"), (5, '127 Hours')]
[(1, 'Javier Bardem'), (2, 'Jeff Bridges'), (3, 'Jesse Eisenberg'), (4, 'Colin Firth'), (5, 'James Franco')]

In [18]:
pairs_query = "select movie,nominee from nominations;"
movie_actor_pairs = conn.execute(pairs_query).fetchall()

In [20]:
join_q = '''INSERT INTO movies_actors (movie_id,actor_id)
VALUES ((SELECT id FROM movies WHERE movie == ?), 
(SELECT id FROM actors WHERE actor == ?));'''
conn.executemany(join_q, movie_actor_pairs)

In [21]:
print(conn.execute("select * from movies_actors limit 5;").fetchall())

[(1, 1, 1), (2, 1, 1), (3, 2, 2), (4, 2, 2), (5, 3, 3)]

So there it is, we have successfully created a join table, linking both the movies and the actors tables with a many-to-many relationship. This means queries can be made on either table refereing the other via this join.